In [1]:
# pemilihan kolom pada data frame berdasarkan tipe data

# import module 
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.3.3
2.3.5

In [3]:
# persiapan data frame 

## DEPRICATED ##
# n_rows = 5
# n_cols = 2
# cols = ['bil_pecahan', 'bil_bulat']

# df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), columns=cols)
# df['bil_pecahan'] = df['bil_pecahan'].astype('float')

# df.index = pd.util.testing.makeDateIndex(n_rows, freq='H')
# df = df.reset_index()

# df['teks'] = list('ABCDE')

# df

n_rows = 5
n_cols = 2
cols = ['bil_pecahan', 'bil_bulat']

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), columns=cols)

df['bil_pecahan'] = df['bil_pecahan'].astype('float')

df.index = pd.date_range(start='2024-10-01', periods=n_rows, freq='h')

df = df.reset_index()
df['teks'] = list('ABCDE')

df

                index  bil_pecahan  bil_bulat teks
0 2024-10-01 00:00:00         12.0          4    A
1 2024-10-01 01:00:00          7.0          5    B
2 2024-10-01 02:00:00          5.0          4    C
3 2024-10-01 03:00:00          3.0          2    D
4 2024-10-01 04:00:00         11.0          9    E

In [4]:

df.dtypes

index          datetime64[ns]
bil_pecahan           float64
bil_bulat               int32
teks                   object
dtype: object

In [5]:
# kolom tipe data numerik
df.select_dtypes(include='number')

   bil_pecahan  bil_bulat
0         12.0          4
1          7.0          5
2          5.0          4
3          3.0          2
4         11.0          9

In [6]:
df.select_dtypes(include='float')

   bil_pecahan
0         12.0
1          7.0
2          5.0
3          3.0
4         11.0

In [7]:
df.select_dtypes(include='int')

   bil_bulat
0          4
1          5
2          4
3          2
4          9

In [ ]:
# kolom bertipe data string/objek
df.select_dtypes(include='object')

  teks
0    A
1    B
2    C
3    D
4    E

In [9]:
# kolom bertipe data datetime
df.select_dtypes(include='datetime')

                index
0 2024-10-01 00:00:00
1 2024-10-01 01:00:00
2 2024-10-01 02:00:00
3 2024-10-01 03:00:00
4 2024-10-01 04:00:00

In [10]:
# memilih kolom dengan kombinasi tipe data
df.select_dtypes(include=['number', 'object'])

   bil_pecahan  bil_bulat teks
0         12.0          4    A
1          7.0          5    B
2          5.0          4    C
3          3.0          2    D
4         11.0          9    E